create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]

set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {ain1[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports {ain1[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {ain2[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports {ain2[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {win1[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports {win1[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {win2[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports {win2[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports rst]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports rst]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.400 [get_ports {sout11[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {sout11[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.400 [get_ports {sout12[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {sout12[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.400 [get_ports {sout21[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {sout21[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -0.400 [get_ports {sout22[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 1.000 [get_ports {sout22[*]}]
